Repository: gasvn/ssh2fa
Catalog: auto2fa-mac/Auto2FA/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Switched to backup link
zh_hans: 已切换到备用链路

source: Switching
zh_hans: 正在切换

source: Sync
zh_hans: 同步

source: Sync preferences via iCloud Drive (free)
zh_hans: 通过 iCloud 云盘同步偏好设置（免费）

source: Syncs only these app preferences across your Macs via a file in iCloud Drive — no paid Apple Developer account needed. Never includes your hosts, tunnels, or 2FA secret.
zh_hans: 仅通过 iCloud 云盘中的一个文件，在你的多台 Mac 间同步这些 App 偏好设置 —— 不需要付费的 Apple 开发者账号。绝不包含你的主机、隧道或 2FA 密钥。

source: System default
zh_hans: 系统默认

source: Tags
zh_hans: 标签

source: Tap to copy 2FA code
zh_hans: 点按拷贝 2FA 验证码

source: Target
zh_hans: 目标

source: Template
zh_hans: 模板

source: Terminal
zh_hans: 终端

source: Test login
zh_hans: 测试登录

source: Testing login…
zh_hans: 正在测试登录…

source: Testing…
zh_hans: 正在测试…

source: That release doesn't publish a downloadable app — update manually this time.
zh_hans: 该版本没有提供可下载的应用 —— 这次请手动更新。

source: That release doesn't include a signed SSH2FA update — update manually this time.
zh_hans: 该版本没有包含经过 SSH2FA 签名的更新 —— 这次请手动更新。

source: The SSH account has expired. Ask the server administrator to renew it before retrying.
zh_hans: SSH 账号已过期。请联系服务器管理员续期后再重试。

source: The SSH account is locked. Wait for the lockout period or ask the server administrator to unlock it before retrying.
zh_hans: SSH 账号已被锁定。请等待锁定期结束，或联系服务器管理员解锁后再重试。

source: Part of SSH2FA is still on an older version. Quit and reopen the app to finish the update.
zh_hans: SSH2FA 的部分组件仍是旧版本。请退出并重新打开应用以完成更新。

source: The disk image didn't contain SSH2FA.
zh_hans: 磁盘映像里没有 SSH2FA。

source: The download didn't match the checksum GitHub published — it may have been corrupted in transit. Try again.
zh_hans: 下载内容与 GitHub 公布的校验和不一致 —— 可能在传输中损坏了。请重试。

source: The download didn't match SSH2FA's signed checksum, so it wasn't installed. Try again.
zh_hans: 下载内容与 SSH2FA 签名的校验和不一致，因此没有安装。请重试。

source: The download failed with HTTP %lld.
zh_hans: 下载失败，HTTP %lld。

source: The downloaded app failed macOS's signature check, so it wasn't installed.
zh_hans: 下载的应用未通过 macOS 的签名校验，因此没有安装。

source: The downloaded app is missing its version information.
zh_hans: 下载的应用缺少版本信息。

source: The first one is what plain “Mount” uses.
zh_hans: 第一个是“挂载”默认使用的文件夹。

source: The first one is what plain “Mount” uses. “Auto” mounts it as soon as the host connects.
zh_hans: 第一个是“挂载”默认使用的文件夹。“自动”会在主机连上后立即挂载。

source: The host name could not be resolved. Check HostName and connect the required VPN/DNS, then retry.
zh_hans: 无法解析主机名。请检查 HostName，并连接所需的 VPN/DNS，然后重试。

source: The server identity key changed. Verify its fingerprint with the server administrator before updating known_hosts.
zh_hans: 服务器身份密钥已更改。在更新 known_hosts 前，请先向服务器管理员核对新指纹。

source: The server is connected but refused a new SSH session. Close old SSH sessions; if it persists, ask the server administrator to check MaxSessions/PAM limits.
zh_hans: 服务器已连接，但拒绝建立新的 SSH 会话。请关闭旧的 SSH 会话；若仍旧如此，请联系服务器管理员检查 MaxSessions/PAM 限制。

source: The server rejected the 2FA code. Check the saved secret and the Mac’s date/time, then update it in Password & setup.
zh_hans: 服务器拒绝了两步验证码。请检查已保存的密钥和 Mac 的日期/时间，然后在"密码与设置"中更新。

source: The server rejected the password. Open Password & setup, replace it, then run Test login.
zh_hans: 服务器拒绝了密码。请打开"密码与设置"替换密码，然后运行"测试登录"。

source: The stored 2FA secret can't be read
zh_hans: 保存的 2FA 密钥无法读取

source: This build isn't running from an app bundle, so it can't update itself.
zh_hans: 这个版本不是从 .app 应用包里运行的，无法自我更新。

source: This update doesn't have a valid SSH2FA signature, so it wasn't installed.
zh_hans: 此更新没有有效的 SSH2FA 签名，因此没有安装。

source: Tighter row height + smaller font for the tunnel table. Helpful when you have more than 10 tunnels.
zh_hans: 隧道表格使用更紧凑的行高和更小的字体。隧道超过 10 条时很有用。

source: Time
zh_hans: 时间

source: Too many SSH keys were tried first. Enable IdentitiesOnly for this host or remove unused keys from ssh-agent, then retry.
zh_hans: 先尝试了过多 SSH 密钥。请为该主机启用 IdentitiesOnly，或从 ssh-agent 中移除不用的密钥，然后重试。

source: Triggers once per tunnel transition idle → alive. If your tunnel hosts a notebook server (jupyter etc.), this saves you a click.
zh_hans: 隧道每次从空闲变为存活时触发一次。如果隧道上跑的是 notebook 服务（如 jupyter），可以省你一次点击。

source: SSH2FA couldn't restore its background connection. Quit and reopen SSH2FA, then use Troubleshoot if the problem continues.
zh_hans: SSH2FA 无法恢复后台连接。请退出并重新打开 SSH2FA；如果问题仍然存在，请使用“故障排查”。

source: SSH2FA couldn't identify that release safely.
zh_hans: SSH2FA 无法安全识别该版本。

source: SSH2FA couldn't verify this update's signature.
zh_hans: SSH2FA 无法验证此更新的签名。

source: Troubleshoot
zh_hans: 排查问题

source: Try a one-shot login with the stored credentials (no effect on your live connection)
zh_hans: 用已存储的凭据做一次性登录测试（不影响你当前的连接）

source: Tunnel actions
zh_hans: 隧道操作

source: Tunnel state changes appear as toasts over the notch. This controls ONLY the notch — failures still show in the dashboard, and macOS notifications still fire when SSH2FA isn't frontmost.
zh_hans: 隧道状态变化会在灵动岛上以提示显示。此项仅控制灵动岛 —— 失败仍会显示在面板中，SSH2FA 不在前台时 macOS 通知也照常发出。

source: Tunnels
zh_hans: 隧道

source: Tunnels forward a local port to a **SLURM compute node** (e.g. a Jupyter server) over your warm SSH connection — and auto-recover when the node or your network changes. If you just want no-retype 2FA SSH, you don't need this — your hosts already work in the Hosts list.
zh_hans: 隧道会通过你已建立的 SSH 连接，把本地端口转发到 **SLURM 计算节点**（比如 Jupyter 服务），并在节点或网络变化时自动恢复。 如果你只想要免重复输入的 2FA SSH，用不到这个 —— 你的主机在“主机”列表里已经能用了。

source: Turn off & remove the Include
zh_hans: 关闭并移除 Include

source: Turn on (backs up config, adds one Include line)
zh_hans: 开启（会备份配置并添加一行 Include）

source: Two-factor secret
zh_hans: 双因素验证密钥

source: Type a command…
zh_hans: 输入命令…

source: Undo
zh_hans: 撤销

source: Uninstall SSH2FA…
zh_hans: 卸载 SSH2FA…

source: Unlock
zh_hans: 解锁

source: Unmount
zh_hans: 卸载

source: Unmount filesystem
zh_hans: 卸载文件系统

source: Unpin %@
zh_hans: 取消固定 %@

source: Up one level
zh_hans: 上一级

source: Update & Relaunch
zh_hans: 更新并重启

source: Update check failed: %@
zh_hans: 检查更新失败：%@

source: Update from Terminal instead
zh_hans: 改用终端命令更新

source: Update with ONE of these (SSH2FA never installs on its own):
zh_hans: 用以下任一方式更新（SSH2FA 绝不会自行安装）：

source: Updates
zh_hans: 更新

source: Use jump host
zh_hans: 使用跳板机

source: Use selected
zh_hans: 使用所选

source: Use this after changing your password on the server. SSH2FA can't detect that change on its own — logins keep failing until the stored password matches.
zh_hans: 在服务器上改过密码后用这里更新。SSH2FA 无法自行察觉这个变化 —— 在存储的密码对上之前，登录会一直失败。

source: User
zh_hans: 用户

source: Username
zh_hans: 用户名

source: Warm connection reuse
zh_hans: 热连接复用

source: Warning: %@ is not in ~/.ssh/config and won't connect
zh_hans: 警告：%@ 不在 ~/.ssh/config 中，无法连接

source: Welcome to SSH2FA
zh_hans: 欢迎使用 SSH2FA

source: When any tunnel is alive or transitioning, a small persistent indicator sits over the notch. Click for the full toast. Off by default — can be visually busy.
zh_hans: 当有隧道存活或正在切换状态时，灵动岛上会常驻一个小指示器。点击可查看完整提示。默认关闭 —— 可能会显得杂乱。

source: Which terminal app a host's “Open Terminal” action launches and SSHes in with.
zh_hans: 主机的“打开终端”操作使用哪个终端 App 来启动并 SSH。

source: Whole filesystem (/)
zh_hans: 整个文件系统 (/)

source: Why sponsor? Hover for the goal — click to open Ko-fi ♥
zh_hans: 为什么赞助？悬停查看目标 —— 点击打开 Ko-fi ♥

source: With auto-connect on, the daemon attempts login for this host every time it starts (or every time the app launches it).
zh_hans: 开启自动连接后，后台助手每次启动（或每次由 App 启动）都会尝试登录此主机。

source: You're on the latest version.
zh_hans: 你已是最新版本。

source: Your 2FA app is seeded by a secret. You need that secret (a base32 string) or the full otpauth:// URL it came from. To reveal it:
zh_hans: 你的 2FA App 是由一个密钥生成的。你需要这个密钥（一串 base32）或它对应的完整 otpauth:// 链接。获取方法：

source: Your login Keychain is locked — unlock it (log out and back in, or open Keychain Access) and try again.
zh_hans: 你的登录钥匙串已锁定 —— 请解锁（注销后重新登录，或打开“钥匙串访问”）后重试。

source: cluster username (optional)
zh_hans: 集群用户名（可选）

source: direct
zh_hans: 直连

source: e.g. lab server, gpu cluster
zh_hans: 例如：实验室服务器、GPU 集群

source: filter (host name, error keyword, …)
zh_hans: 筛选（主机名、错误关键词…）

source: macOS didn't allow access to the saved credential. Try again and choose “Always Allow” on the Keychain prompt — then it won't ask again.
zh_hans: macOS 未允许访问已保存的凭据。请重试，并在钥匙串弹窗上选择“始终允许”—— 之后就不会再问了。

source: macOS didn't allow access to the saved credentials. Open a host's Password & Setup, try again, and choose “Always Allow”.
zh_hans: macOS 没有放行对已存凭据的访问。请打开任一主机的"密码与设置"重试,并选择「始终允许」。

source: macOS hasn't allowed access yet — a Keychain prompt may be waiting for you. Choose “Always Allow” there, then try again.
zh_hans: macOS 还未授予访问权限 —— 可能有一个钥匙串弹窗在等你。请在上面选择“始终允许”，然后重试。

source: macOS is running SSH2FA from a temporary read-only copy. Move the app to your Applications folder and open it from there, then updates install with one click.
zh_hans: macOS 正在以一份临时只读副本运行 SSH2FA。请把应用移到"应用程序"文件夹，并从那里打开，之后更新就能一键完成。

source: macOS is still asking every time. That happens when “Allow” is chosen instead of “Always Allow” — “Allow” permits one single use. Next time the prompt appears, choose “Always Allow” and it will stop.
zh_hans: macOS 仍然每次都在询问。这通常是因为点了「允许」而不是「始终允许」——「允许」只放行这一次。下次弹出时请选「始终允许」,就不会再问了。

source: name (optional)
zh_hans: 名称（可选）

source: new password
zh_hans: 新密码

source: on a cluster? · ⌘N
zh_hans: 在用集群？· ⌘N

source: otpauth://totp/…?secret=… — or just the secret key
zh_hans: otpauth://totp/…?secret=… —— 或直接填密钥

source: password
zh_hans: 密码

source: ready
zh_hans: 就绪

source: via %@
zh_hans: 经由 %@

source: your login name
zh_hans: 你的登录名

source: your login name on the server
zh_hans: 你在服务器上的登录名

source: “%@” isn't a Host in ~/.ssh/config
zh_hans: “%@”不是 ~/.ssh/config 中的 Host

source: SSH2FA couldn't start. Quit and reopen the app, then use Troubleshoot if the problem continues.
zh_hans: SSH2FA 无法启动。请退出并重新打开应用；如果问题仍然存在，请使用“故障排查”。

source: Restore connections
zh_hans: 恢复连接

source: check hosts and restore interrupted connections
zh_hans: 检查主机并恢复中断的连接

source: stop tunnels and reconnect every host
zh_hans: 停止隧道并重新连接所有主机

source: Restore host connections and tunnels after wake
zh_hans: 唤醒后恢复主机连接和隧道

source: Sleep can interrupt long-running SSH connections. Recommended on — SSH2FA checks and restores them automatically when your Mac wakes.
zh_hans: 睡眠可能中断长时间运行的 SSH 连接。建议开启 —— Mac 唤醒时，SSH2FA 会自动检查并恢复连接。

source: With auto-connect on, SSH2FA restores this host connection automatically after login, restart, or network recovery.
zh_hans: 开启自动连接后，SSH2FA 会在登录、重启或网络恢复后自动恢复这台主机的连接。

source: Choose the next unused local port
zh_hans: 选择下一个未使用的本地端口

source: Restoring connections…
zh_hans: 正在恢复连接…

source: checking hosts and tunnels
zh_hans: 正在检查主机和隧道

source: SSH2FA is still starting or recovering. Wait a moment and try again.
zh_hans: SSH2FA 仍在启动或恢复中。请稍等片刻后重试。

source: ⚠︎ This Mac can't evaluate Touch ID or a login password right now — the lock may not engage.
zh_hans: ⚠︎ 这台 Mac 目前无法验证 Touch ID 或登录密码 —— 锁定可能不会生效。

source: ⚠︎ iCloud Drive isn't available — turn it on in System Settings to sync.
zh_hans: ⚠︎ iCloud 云盘不可用 —— 请在系统设置中开启以进行同步。

source: Approve any macOS confirmation that appears, then keep this window open until setup completes.
zh_hans: 请批准出现的 macOS 确认，然后保持此窗口打开，直到设置完成。

source: Automatic connections are ready
zh_hans: 自动连接已就绪

source: Complete this once so future launches, reconnects, and updates don't ask for your Mac password again.
zh_hans: 只需完成一次，以后启动、重连和更新都不会再要求输入 Mac 密码。

source: Continue
zh_hans: 继续

source: Current SSH connections keep running while the update finishes.
zh_hans: 更新期间，当前 SSH 连接会继续运行。

source: Designed to prevent future password prompts
zh_hans: 避免以后再次弹出密码提示

source: Finish a one-time security update
zh_hans: 完成一次性安全更新

source: Finish update
zh_hans: 完成更新

source: Finishing securely…
zh_hans: 正在安全完成…

source: Not now
zh_hans: 暂不

source: Older installations may show more than one macOS confirmation because each saved login was protected separately. Approve each one; this is the final time.
zh_hans: 较早的版本会分别保护每个已保存登录，因此 macOS 可能显示多次确认。请逐一批准；这是最后一次。

source: One-time security update
zh_hans: 一次性安全更新

source: Securing saved logins
zh_hans: 正在保护已保存的登录信息

source: Setup complete
zh_hans: 设置完成

source: Setup wasn't completed
zh_hans: 设置尚未完成

source: SSH2FA couldn't finish the security update. No saved login was lost. Approve the macOS confirmation and try again.
zh_hans: SSH2FA 未能完成安全更新。已保存的登录信息没有丢失。请批准 macOS 确认后重试。

source: SSH2FA improved how saved logins are protected. Finish this update once, and normal connections will stay automatic and quiet.
zh_hans: SSH2FA 改进了已保存登录信息的保护方式。完成这一次更新后，日常连接会保持自动且安静。

source: This can take a minute on older installations
zh_hans: 较早的安装可能需要一分钟

source: Try again
zh_hans: 重试

source: You can try again now or continue using SSH2FA and finish after the next launch.
zh_hans: 你可以现在重试，也可以继续使用 SSH2FA，并在下次启动后完成。

source: You do not need to enter an SSH password or a 2FA code again.
zh_hans: 无需再次输入 SSH 密码或 2FA 验证码。

source: Your saved login is ready. Future launches, reconnects, and updates should not ask for your Mac password again.
zh_hans: 已保存的登录信息已就绪。以后启动、重连和更新都不应再要求输入 Mac 密码。

source: Your saved logins are ready. Future launches, reconnects, and updates should not ask for your Mac password again.
zh_hans: 已保存的登录信息已就绪。以后启动、重连和更新都不应再要求输入 Mac 密码。

source: Your saved logins are unchanged
zh_hans: 已保存的登录信息未发生变化

source: Your SSH password and 2FA secret stay protected on this Mac.
zh_hans: SSH 密码和 2FA 密钥会安全保存在这台 Mac 上。

source: An older version saved each login separately. Review the one-time migration so future launches, reconnects, and updates stay automatic without Mac password prompts.
zh_hans: 旧版本会分别保存每个登录信息。请先查看这次一次性迁移；完成后，启动、重连和更新会保持自动进行，不再弹出 Mac 密码提示。

source: Approve each macOS confirmation that appears, then keep this migration window open until it completes.
zh_hans: 请逐一批准出现的 macOS 确认，并保持迁移窗口打开直到完成。

source: Current SSH connections keep running while the migration finishes.
zh_hans: 迁移期间，当前 SSH 连接会继续运行。

source: If you have several saved logins, macOS may show more than one confirmation because the old items were protected separately. Approve each one; this is the final migration.
zh_hans: 如果保存了多个登录信息，由于旧项目是分别保护的，macOS 可能显示多次确认。请逐一批准；这是最后一次迁移。

source: Migrate saved logins
zh_hans: 迁移已保存的登录信息

source: Migrating saved logins
zh_hans: 正在迁移已保存的登录信息

source: Migration in progress…
zh_hans: 正在迁移…

source: Moving old saved logins into the new protected format
zh_hans: 正在将旧登录信息迁移到新的安全格式

source: Older SSH2FA versions saved each login separately. This migration moves them into the new protected format so future updates stay quiet.
zh_hans: 旧版 SSH2FA 会分别保存每个登录信息。这次迁移会将它们移到新的安全格式中，让以后的更新不再弹出密码提示。

source: One-time migration from an older SSH2FA version
zh_hans: 来自旧版 SSH2FA 的一次性迁移

source: Review migration
zh_hans: 查看迁移说明

source: SSH2FA couldn't finish migrating your saved logins. Nothing was lost. Approve the macOS migration confirmation and try again.
zh_hans: SSH2FA 未能完成已保存登录信息的迁移。没有任何数据丢失。请批准 macOS 的迁移确认后重试。

source: Start migration
zh_hans: 开始迁移

source: The macOS password dialog that may appear next is authorizing SSH2FA to read and migrate logins saved by older versions. It is not an SSH login. Your Mac password goes only to macOS; SSH2FA never receives it.
zh_hans: 接下来可能出现的 macOS 密码框，是在授权 SSH2FA 读取并迁移旧版本保存的登录信息，并不是在登录 SSH 服务器。你的 Mac 密码只会交给 macOS，SSH2FA 无法看到。

source: Why macOS may ask for your password
zh_hans: 为什么 macOS 可能要求输入密码

source: 2FA secret (optional — otpauth:// URL or secret key)
zh_hans: 两步验证密钥（可选 —— otpauth:// 链接或密钥串）

source: leave empty if this account has no 2FA
zh_hans: 该账号没有两步验证就留空

source: Only fill this in if the server asks for a verification code. It needs a TOTP secret key — **not Duo Push** (approve-on-phone). Paste the otpauth:// URL or the bare base32 secret, or screenshot the QR and click “Scan QR”.
zh_hans: 只有当服务器会要求输入验证码时才需要填。需要 TOTP 密钥 —— **不是 Duo Push**（手机点确认那种）。粘贴 otpauth:// 链接或纯 base32 密钥，或者截图二维码后点“扫描二维码”。

source: No 2FA on this account? Leave it empty — you can add a secret later in Password & setup.
zh_hans: 账号没有两步验证？留空即可 —— 以后可以在“密码与设置”里补上密钥。

source: 2FA secret:
zh_hans: 两步验证密钥：

source: none — this host signs in with a password only
zh_hans: 无 —— 此主机只用密码登录

source: No 2FA secret stored — this host signs in with a password only
zh_hans: 未保存两步验证密钥 —— 此主机只用密码登录

source: If the server starts asking for a verification code, add the secret below.
zh_hans: 如果服务器开始要求输入验证码，在下面添加密钥即可。

source: Remove 2FA secret
zh_hans: 移除两步验证密钥

source: For an account that no longer uses 2FA — logins will use the password alone.
zh_hans: 适用于不再使用两步验证的账号 —— 登录将只用密码。

source: Add a host (SSH password, plus a 2FA secret if the server asks for codes)
zh_hans: 添加主机（SSH 密码；若服务器要验证码，再加两步验证密钥）
